import { PrismaClient } from '@prisma/client';

const prisma = new PrismaClient();

// TODO: Move this to helpers
const parseDate = (date: string) => {
  const dateParts = date.split('-').map(Number)
  return new Date(dateParts[0], dateParts[1] - 1, dateParts[2])
}

async function main() {
  const bill = await prisma.bill.create({
    data: {
      originId: '9648',
      registration: parseDate('2023-08-25'),
      url: 'https://itd.rada.gov.ua/billInfo/Bills/Card/42602',

      title: 'Проект Закону про ратифікацію Рамкової угоди між Урядом України та Урядом Республіки Австрія про економічне співробітництво у розвитку проектів',
      shortTitle: 'Посилення відповідальності за корупцію під час воєнного або надзвичайного стану',
      veryShortTitle: 'Посилення відповідальності за корупцію під час війни',

      shortContent: 'Закон України «Про внесення змін до деяких законів України (щодо справедливої мобілізації народних депутатів України)» передбачає виключення народних депутатів з обов\'язку служити при мобілізації. Також з нього виключається стаття 29 Закону "Про статус народного депутата України".',
      veryShortContent: 'Закон України про зміни в законах стосовно мобілізації народних депутатів: вони більше не зобов\'язані служити при мобілізації, і втрачається їхня особлива стаття статусу.',
      content: 'ПРОЕКТ \nвноситься народним депутатом України\nДубінським О.А.\nЗАКОН УКРАЇНИ\n«Про внесення змін до деяких законів України (щодо справедливої\nмобілізації народних депутатів України)»\n__________________________________________________\nВерховна Рада України п о с т а н о в л я є:\nI. Внести зміни до таких законодавчих актів України:\n1. У Законі України «Про мобілізаційну підготовку та мобілізацію»\n(Відомості Верховної Ради України, 2005 р., № 16, ст. 255 із наступними\nзмінами):\n1) у абзаці чотирнадцятому частини першої статті 23 слова "народні\nдепутати України " виключити.\n2. У Законі України "Про статус народного депутата України"\n(Відомості Верховної Ради України, 2001 р., № 42, ст. 212; із наступними\nзмінами):\n1) статтю 29 виключити.\nII. Прикінцеві положення\n1. Цей Закон набирає чинності з дня, наступного за днем його\nопублікування.\n2. Кабінету Міністрів України протягом місяця з дня набрання чинності\nцим Законом:\nпривести свої нормативно-правові акти у відповідність із цим Законом;\n2\nвжити заходів щодо прийняття та/або оновлення нормативно-правових\nактів центральних органів виконавчої влади, що випливають із цього Закону.\nГолова\nВерховної Ради України Руслан СТЕФАНЧУК',
      initiators: ['Дубінський Олександр Анатолійович (IX скликання)'],
      session: '9 сесія IX скликання',
      rubric: 'Безпека і оборона',
      
      steps: {
        create: [{
          name: 'Одержано Верховною Радою України',
          date: parseDate('2023-24-08'),
        }, {
          name: 'Передано на розгляд керівництву',
          date: parseDate('2023-08-24'),
        }, {
          name: 'Направлено на розгляд Комітету',
          date: parseDate('2023-08-28'),
        }, {
          name: 'Надано для ознайомлення',
          date: parseDate('2023-08-29'),          
        }]
      },

      other_committees: ["Кальченко С. В. Комітет Верховної Ради України з питань Регламенту, депутатської етики та організації роботи Верховної Ради України", "Маслов Д. В. Комітет Верховної Ради України з питань правової політики", "Підласа Р. А. Комітет Верховної Ради України з питань бюджету"],
      main_committee: "Завітневич О. М. Комітет Верховної Ради України з питань національної безпеки, оборони та розвідки",
      docs: {
        create: [{
          name: "Проект Закону (28.08.2023)",
          url: "https://itd.rada.gov.ua/billInfo/Bills/pubFile/1944156"
        }, {
          name: "Порівняльна таблиця (28.08.2023)",
          url: "https://itd.rada.gov.ua/billInfo/Bills/pubFile/1944162"
        },{
          name: "Пояснювальна записка (28.08.2023)",
          url: "https://itd.rada.gov.ua/billInfo/Bills/pubFile/1944159"
        }, {
          name: "Подання (28.08.2023",
          url: "https://itd.rada.gov.ua/billInfo/Bills/pubFile/1944163"
        }, {
          name: "Проект Постанови до Закону (іншого Акта) (28.08.2023)",
          url: "https://itd.rada.gov.ua/billInfo/Bills/pubFile/1944165"
        }]
      },
    },
  });
  console.log({ bill });
}
main()
  .then(async () => {
    await prisma.$disconnect();
  })
  .catch(async (e) => {
    console.error('Prisma seed error: ', e);
    await prisma.$disconnect();
    process.exit(1);
  });
